{
  "module": "keras",
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
        "name": "float32"
      },
      "registered_name": null,
      "shared_object_id": 1250252867856
    },
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [
            null,
            130,
            40
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_layer",
          "optional": false
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Bidirectional",
        "config": {
          "name": "bidirectional",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "merge_mode": "concat",
          "layer": {
            "module": "keras.layers",
            "class_name": "LSTM",
            "config": {
              "name": "forward_lstm",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "zero_output_for_mask": true,
              "units": 32,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null,
                "shared_object_id": 1250252871056
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "seed": null,
                  "gain": 1.0
                },
                "registered_name": null,
                "shared_object_id": 1250252871376
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null,
                "shared_object_id": 1250252224848
              },
              "unit_forget_bias": true,
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L2",
                "config": {
                  "l2": 0.001
                },
                "registered_name": null,
                "shared_object_id": 1250252871696
              },
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "seed": null
            },
            "registered_name": null,
            "build_config": {
              "input_shape": [
                null,
                130,
                40
              ]
            }
          },
          "backward_layer": {
            "module": "keras.layers",
            "class_name": "LSTM",
            "config": {
              "name": "backward_lstm",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "return_sequences": true,
              "return_state": false,
              "go_backwards": true,
              "stateful": false,
              "unroll": false,
              "zero_output_for_mask": true,
              "units": 32,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null,
                "shared_object_id": 1250252873296
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "seed": null,
                  "gain": 1.0
                },
                "registered_name": null,
                "shared_object_id": 1250252873616
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null,
                "shared_object_id": 1250253144144
              },
              "unit_forget_bias": true,
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L2",
                "config": {
                  "l2": 0.001
                },
                "registered_name": null,
                "shared_object_id": 1250252873936
              },
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "seed": null
            },
            "registered_name": null,
            "build_config": {
              "input_shape": [
                null,
                130,
                40
              ]
            }
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            130,
            40
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null,
            "shared_object_id": 1250252867856
          },
          "rate": 0.4,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Bidirectional",
        "config": {
          "name": "bidirectional_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null,
            "shared_object_id": 1250252867856
          },
          "merge_mode": "concat",
          "layer": {
            "module": "keras.layers",
            "class_name": "LSTM",
            "config": {
              "name": "forward_lstm_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "zero_output_for_mask": false,
              "units": 16,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null,
                "shared_object_id": 1250253148096
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "seed": null,
                  "gain": 1.0
                },
                "registered_name": null,
                "shared_object_id": 1250253148704
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null,
                "shared_object_id": 1250252741072
              },
              "unit_forget_bias": true,
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L2",
                "config": {
                  "l2": 0.001
                },
                "registered_name": null,
                "shared_object_id": 1250253149008
              },
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "seed": null
            },
            "registered_name": null,
            "build_config": {
              "input_shape": [
                null,
                130,
                64
              ]
            }
          },
          "backward_layer": {
            "module": "keras.layers",
            "class_name": "LSTM",
            "config": {
              "name": "backward_lstm_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "return_sequences": false,
              "return_state": false,
              "go_backwards": true,
              "stateful": false,
              "unroll": false,
              "zero_output_for_mask": false,
              "units": 16,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null,
                "shared_object_id": 1250262143280
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "seed": null,
                  "gain": 1.0
                },
                "registered_name": null,
                "shared_object_id": 1250262143568
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null,
                "shared_object_id": 1250252742160
              },
              "unit_forget_bias": true,
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L2",
                "config": {
                  "l2": 0.001
                },
                "registered_name": null,
                "shared_object_id": 1250262143856
              },
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "seed": null
            },
            "registered_name": null,
            "build_config": {
              "input_shape": [
                null,
                130,
                64
              ]
            }
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            130,
            64
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null,
            "shared_object_id": 1250252867856
          },
          "rate": 0.4,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null,
            "shared_object_id": 1250252867856
          },
          "units": 5,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "quantization_config": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            32
          ]
        }
      }
    ],
    "build_input_shape": [
      null,
      130,
      40
    ]
  },
  "registered_name": null,
  "build_config": {
    "input_shape": [
      null,
      130,
      40
    ]
  },
  "compile_config": {
    "optimizer": {
      "module": "keras.optimizers",
      "class_name": "Adam",
      "config": {
        "name": "adam",
        "learning_rate": 3.125000148429535e-05,
        "weight_decay": null,
        "clipnorm": 1.0,
        "global_clipnorm": null,
        "clipvalue": null,
        "use_ema": false,
        "ema_momentum": 0.99,
        "ema_overwrite_frequency": null,
        "loss_scale_factor": null,
        "gradient_accumulation_steps": null,
        "beta_1": 0.9,
        "beta_2": 0.999,
        "epsilon": 1e-07,
        "amsgrad": false
      },
      "registered_name": null
    },
    "loss": "sparse_categorical_crossentropy",
    "loss_weights": null,
    "metrics": [
      "accuracy"
    ],
    "weighted_metrics": null,
    "run_eagerly": false,
    "steps_per_execution": 1,
    "jit_compile": false
  }
}